import random

recommendations = {
    "похудение": {
        "food": [
            "🥗 Салаты с курицей",
            "🍏 Яблоки",
            "🥑 Авокадо",
            "🍣 Лосось",
            "🥦 Брокколи",
        ],
        "workout": [
            "🏃‍♂️ Бег 30 мин",
            "🚴‍♂️ Велотренажёр",
            "🏋️‍♂️ HIIT-тренировка",
            "🧘‍♀️ Йога",
        ],
    },
    "поддержание": {
        "food": ["🍗 Курица-гриль", "🍠 Батат", "🥑 Авокадо", "🍳 Яичница с овощами"],
        "workout": [
            "💪 Силовая тренировка",
            "🏊‍♂️ Плавание",
            "🏋️‍♂️ Функциональный тренинг",
        ],
    },
    "набор массы": {
        "food": [
            "🥩 Говядина",
            "🥜 Орехи",
            "🍞 Цельнозерновой хлеб",
            "🥚 Омлет с сыром",
        ],
        "workout": ["🏋️‍♂️ Тренировка на массу", "🚶‍♂️ Ходьба после еды", "🤸‍♂️ Растяжка"],
    },
}


def get_recommendations(goal):
    goal = goal.lower()
    food = random.choice(recommendations[goal]["food"])
    workout = random.choice(recommendations[goal]["workout"])

    return f"🍽 Полезная еда: {food}\n🏋️ Тренировка:{workout}"
